#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-aDgFojj1532PKHfa

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_iam_role.crawler_role: Refreshing state... [id=crawler_role]
aws_default_vpc.default: Refreshing state... [id=vpc-00316a594b8442850]
aws_sqs_queue.crawled_urls: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/847035122536/crawled_urls]
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e9b3892f4f02491c]
aws_eip.natgw_eip: Refreshing state... [id=eipalloc-0a4e9e11e5c926383]
aws_iam_role.scanner_role: Refreshing state... [id=scanner_role]
aws_lambda_layer_version.boto3_layer: Refreshing state... [id=arn:aws:lambda:us-west-2:847035122536:layer:boto3_layer:3]
aws_apigatewayv2_api.lambda: Refreshing state... [id=32j4ixnfl1]
aws_efs_file_system.nuclei_efs: Refreshing state... [id=fs-0c52002cea26f5b0a]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0ba686db12ac78bd2]
aws_iam_policy.sqs_publish_policy: Refreshing state... [id=arn:aws:iam::847035122536:policy/sqs_publish_policy]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_efs_access_point.nuclei_efs_access_point: Refreshing state... [id=fsap-0fbb0b5047c7df8c6]
aws_iam_role_policy_attachment.scanner_policy_attach_vpc_access: Refreshing state... [id=scanner_role-20220616035130861100000007]
aws_iam_role_policy_attachment.scanner_policy_attach_efs_access: Refreshing state... [id=scanner_role-20220616035130854700000006]
aws_iam_role_policy_attachment.scanner_policy_attach_sqs_execution: Refreshing state... [id=scanner_role-20220616035130907600000008]
aws_iam_role_policy_attachment.scanner_policy_attach_lambda_basic: Refreshing state... [id=scanner_role-20220616035130850800000005]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220616035130752900000002]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_iam_role_policy_attachment.crawler_policy_attach_readonly: Refreshing state... [id=crawler_role-20220616035130771200000003]
aws_iam_role_policy_attachment.crawler_policy_attach_sqs_publish: Refreshing state... [id=crawler_role-20220616035156247900000009]
aws_iam_role_policy_attachment.crawler_policy_attach_lambda_basic: Refreshing state... [id=crawler_role-20220616035130791500000004]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=sbejgdq]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_cloudwatch_log_group.crawler: Refreshing state... [id=/aws/lambda/crawler]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=dg3h235]
aws_subnet.private_az2: Refreshing state... [id=subnet-0fa04ec2fa0223908]
aws_route_table.private_rt: Refreshing state... [id=rtb-00f038fc0e4e7d764]
aws_default_security_group.default: Refreshing state... [id=sg-0dfa3e4d75f7cdb3a]
aws_subnet.private_az1: Refreshing state... [id=subnet-031c8bc2b6d54ae65]
aws_efs_mount_target.nuclei_efs_mount_target2: Refreshing state... [id=fsmt-0147c3d92467f1464]
aws_route_table_association.subnet2_rt: Refreshing state... [id=rtbassoc-00d044df1f26c0843]
aws_route_table_association.subnet1_rt: Refreshing state... [id=rtbassoc-0f760019a54d6e578]
aws_efs_mount_target.nuclei_efs_mount_target1: Refreshing state... [id=fsmt-07d6b651f97e6c5eb]
aws_lambda_function.scanner: Refreshing state... [id=scanner]
aws_cloudwatch_log_group.scanner: Refreshing state... [id=/aws/lambda/scanner]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.example will be created
  + resource "aws_lambda_event_source_mapping" "example" {
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:us-west-2:847035122536:crawled_urls"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:us-west-2:847035122536:function:scanner"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-16T03:51:56.222+0000" -> (known after apply)
      ~ source_code_hash               = "MF43+vga9WITzmkxrLPXRcBcSL9BoR7Hrp4PC+ca/xY=" -> "6hRDMd3XVaOzz96wsd/Yxqu9K/AB8bpDt/V4ECHhTkg="
        tags                           = {}
        # (18 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.scanner will be updated in-place
  ~ resource "aws_lambda_function" "scanner" {
        id                             = "scanner"
      ~ last_modified                  = "2022-06-17T03:30:59.000+0000" -> (known after apply)
      ~ memory_size                    = 512 -> 1028
      ~ source_code_hash               = "CjDZdUf+iREx7n6iWw6lsm2ez8fhbM1+Kvut3zLkZSk=" -> "dFqkHRYVeSj8gyX+QAU0UPSSdwH+iJSqqoQLIYJelRc="
        tags                           = {}
        # (17 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-16T03:51:44.567+0000" -> (known after apply)
      ~ source_code_hash               = "TPgUPpEj/V20qUcEbo9rwvkyIpCwT4tIRziloFKiBHM=" -> "ZOUiAfvP/lQF0J+MMYRJJwsIskcwANXU989YzmYK1mc="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.


```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*